brew "jq"
brew "wget"
brew "tfenv"
brew "pipenv"
brew "awscli"
brew "travis"
brew "openjdk"

cask "snowflake-snowsql"
cask "ccmenu"
cask "tuple"
cask "zoom"
cask "1password"
cask "1password-cli"
cask "docker"
cask "google-chrome"
cask "iterm2"
cask "postman"
cask "visual-studio-code"
cask "slack"
cask "jetbrains-toolbox"
