brew "mas"
brew "jq"
brew "fastgron"
brew "gh"
brew "wakeonlan"
brew "ollama"
brew "ffmpeg"
brew "yt-dlp"

cask "alfred"
cask "1password"
cask "1password-cli"
cask "docker-desktop"
cask "fig"
cask "google-chrome"
cask "iterm2"
cask "postman"
cask "visual-studio-code"
cask "ticktick"
cask "tiles"
cask "whatsapp"
cask "secretive"
cask "hammerspoon"
