brew "mas"
brew "jq"
brew "fastgron"

cask "alfred"
cask "1password"
cask "1password-cli"
cask "docker"
cask "fig"
cask "google-chrome"
cask "iterm2"
cask "postman"
cask "visual-studio-code"
cask "ticktick"
cask "tiles"
cask "whatsapp"
cask "secretive"
