tap "jhlee0409/tap"
tap "letsur-dev/claude-peak", "https://github.com/letsur-dev/claude-peak.git"
# Why is this running?
brew "witr"
# Claude Max subscription usage monitor for macOS menu bar
brew "letsur-dev/claude-peak/claude-peak"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# Terminal-based AI coding assistant
cask "claude-code"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Web browser
cask "google-chrome"
# GPU-accelerated terminal emulator
cask "ghostty"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Desktop automation application
cask "hammerspoon"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Store SSH keys in the Secure Enclave
cask "secretive"
# Music streaming service
cask "spotify"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Native GUI for Homebrew package management
cask "taphouse"
# Open-source code editor
cask "visual-studio-code"
# JavaScript IDE
cask "webstorm"
# Put the output from any script or program into your macOS Menu Bar
cask "xbar"
# Gecko based web browser
cask "zen"
